Repository: hodz417/quiz
Catalog: lib/core/utils/l10n/app_*.arb
Languages: ar

source: Arabic
ar: العربية

# heroTitleLine1
source: Discover your career path
ar: اكتشف مسارك المهني

# heroTitleLine2
source: with AI
ar: مع الذكاء الاصطناعي

# heroDescription
source: A comprehensive platform that helps you identify your skills and build your career path through smart guidance and personalized courses
ar: منصة شاملة تساعدك في تحديد مهاراتك وبناء مسارك المهني من خلال التوجيه الذكي والدورات المخصصة

# heroStartNow
source: Start Now →
ar: ابدأ الآن ←

# heroLogin
source: Login
ar: تسجيل الدخول

# howItWorksTitle
source: How does Multiverse Mentor work?
ar: كيف يعمل Multiverse Mentor؟

# howItWorksSubtitle
source: Three simple steps to reach your ideal career path
ar: ثلاث خطوات بسيطة للوصول إلى مسارك المهني المثالي

# featureContinuousGuidanceTitle
source: Continuous Guidance
ar: إرشاد مستمر

# featureContinuousGuidanceDescription
source: Ongoing follow-up with a smart mentor to help you develop your skills and achieve your goals
ar: متابعة مستمرة مع مرشد ذكي لمساعدتك على تطوير مهاراتك وتحقيق أهدافك

# featureSmartRecommendationsTitle
source: Smart Recommendations
ar: توصيات ذكية

# featureSmartRecommendationsDescription
source: Get personalized recommendations for skills and courses based on your personality analysis
ar: احصل على توصيات مخصصة للمهارات والدورات بناءً على تحليل شخصيتك

# featurePersonalityAnalysisTitle
source: Personality Analysis
ar: تحليل الشخصية

# featurePersonalityAnalysisDescription
source: An advanced questionnaire to analyze your personality and learning styles to determine the best path for you
ar: استبيان متقدم لتحليل شخصيتك وأنماط تعلمك لتحديد المسار الأنسب لك

# footerServices
source: Services
ar: الخدمات

# footerServiceGuidance
source: Guidance
ar: الإرشاد

# footerServicePersonalityAnalysis
source: Personality Analysis
ar: تحليل الشخصية

# footerServiceCourses
source: Courses
ar: الدورات

# footerQuickLinks
source: Quick Links
ar: روابط سريعة

# footerQuickLinksDashboard
source: Dashboard
ar: لوحة التحكم

# footerQuickLinksProjects
source: Projects
ar: المشروعات

# footerQuickLinksMentoring
source: Mentoring
ar: تعرف علي فريقنا

# footerPlatformDescription
source: A comprehensive platform for skill development and career guidance
ar: منصة شاملة لتطوير المهارات والإرشاد المهني

# footerContactUs
source: Contact Us
ar: تواصل معنا

# loginTitle
source: Login
ar: تسجيل الدخول

# loginSubtitle
source: Welcome back! Sign in to your account
ar: مرحبًا بعودتك! ادخل إلى حسابك

# emailLabel
source: Email
ar: البريد الإلكتروني

# emailHint
source: Enter your email
ar: أدخل بريدك الإلكتروني

# emailRequired
source: Email is required
ar: البريد الإلكتروني مطلوب

# emailInvalid
source: Enter a valid email
ar: أدخل بريد إلكتروني صحيح

# passwordLabel
source: Password
ar: كلمة المرور

# passwordHint
source: Enter your password
ar: أدخل كلمة المرور

source: Remember me
ar: تذكرني

source: Forgot password?
ar: نسيت كلمة المرور؟

# orLoginWith
source: Or log with
ar: أو سجل باستخدام

# noAccount
source: Don't have an account?
ar: ليس لديك حساب؟

# createAccount
source: Create a new account
ar: إنشاء حساب جديد

# signUpTitle
source: Create Account
ar: إنشاء حساب جديد

# signUpSubtitle
source: Join us and start your journey towards a successful career
ar: انضم إلينا وابدأ رحلتك نحو مسيرة مهنية ناجحة

# labelFullname
source: Full Name
ar: الاسم الكامل

source: Confirm Password
ar: تأكيد كلمة المرور

# fullNameHint
source: Enter your full name
ar: أدخل اسمك الكامل

# fullNameRequired
source: Full name is required
ar: الاسم الكامل مطلوب

# fullNameInvalid
source: Invalid full name
ar: الاسم الكامل غير صالح

# confirmPasswordHint
source: Re-enter your password
ar: أدخل كلمة المرور مرة أخرى

# alreadyHaveAccount
source: Already have an account?
ar: هل لديك حساب بالفعل؟

# fullNameMinLength
source: Full name must be at least 3 characters
ar: يجب أن يتكون الاسم الكامل من 3 أحرف على الأقل

# passwordMismatch
source: Passwords do not match
ar: كلمات المرور غير متطابقة

# heroShortDescription
source: Identify your skills and grow with AI.
ar: حدد مهاراتك وتطور مع الذكاء الاصطناعي.

# level1Title
source: Level 1 – Quick Check
ar: المستوى 1 – فحص سريع

# level1Description
source: Questions: 20 Duration: 15 – 20 minutes Focus: Communication, Initiative, Problem-Solving, Responsibility, Curiosity
ar: الأسئلة: 20 المدة: 15 – 20 دقيقة التركيز: التواصل، المبادرة، حل المشكلات، المسؤولية، الفضول

# level2Title
source: Level 2 – In-Depth
ar: المستوى 2 – تحليل معمق

# level2DescriptionMobile
source: Questions: 40 Duration: 30 – 40 minutes Focus: Collaboration, Leadership, Flexibility, Time Management, Customer Handling
ar: الأسئلة: 40 المدة: 30 – 40 دقيقة التركيز: التعاون، القيادة، المرونة، إدارة الوقت، التعامل مع العملاء

# level2DescriptionDesktop
source: Questions: 60 Duration: 30 – 40 minutes Focus: Collaboration, Leadership, Flexibility, Time Management, Customer Handling
ar: الأسئلة: 60 المدة: 30 – 40 دقيقة التركيز: التعاون، القيادة، المرونة، إدارة الوقت، التعامل مع العملاء

# level2CardGradientNote
source: Uses green gradient styling
ar: تستخدم البطاقة تدرجًا لونيًا أخضر

# level3Title
source: Level 3 – Professional Challenge
ar: المستوى 3 – التحدي المهني

# level3DescriptionMobile
source: Questions: 60 Duration: More than 1 hour Focus: Strategic Thinking, Innovation, Long-Term Planning, Entrepreneurial Mindset
ar: الأسئلة: 60 المدة: أكثر من ساعة التركيز: التفكير الاستراتيجي، الابتكار، التخطيط طويل المدى، عقلية ريادية

# level3DescriptionDesktop
source: Questions: +100 Duration: More than 1 hour Focus: Strategic Thinking, Innovation, Long-Term Planning, Entrepreneurial Mindset
ar: الأسئلة: +100 المدة: أكثر من ساعة التركيز: التفكير الاستراتيجي، الابتكار، التخطيط طويل المدى، عقلية ريادية

# startLevelAction
source: Start
ar: ابدأ

# progressQuestion
source: Question
ar: السؤال

# progressOf
source: of
ar: من

source: Next
ar: التالي

source: Previous
ar: السابق

# pleaseChooseRating
source: Please choose a rating
ar: يرجى اختيار تقييم

# pleaseSelectOption
source: Please select an option
ar: يرجى اختيار خيار

source: Type your answer...
ar: اكتب إجابتك...

source: Please type your answer
ar: يرجى كتابة إجابتك

# minLengthError
source: Answer must be at least 2 characters
ar: يجب أن تكون الإجابة 2 أحرف على الأقل

source: Strongly Agree
ar: موافق بشدة

source: Agree
ar: موافق

source: Neutral
ar: محايد

source: Disagree
ar: غير موافق

source: Strongly Disagree
ar: غير موافق بشدة

source: Congratulations!
ar: تهانينا!

source: Personality
ar: الشخصية

source: Learning Style
ar: أسلوب التعلم

source: Goals
ar: الأهداف

source: Strengths
ar: نقاط القوة

source: Download Report
ar: تحميل التقرير

# reportDownloadStarted
source: Report download started — check your browser's downloads folder.
ar: تم بدء تحميل التقرير — تحقق من مجلد التنزيلات في متصفحك.

# detailedReportNote
source: Detailed report with all results
ar: تقرير مفصل مع جميع النتائج

# detailedReportWithFullResults
source: Download your full report now — one small click toward big progress
ar: نزّل التقرير الكامل الآن — خطوة صغيرة تقود لتقدم كبير.

source: Multiverse Mentor Assessment Report
ar: تقرير تقييم Multiverse Mentor

source: Executive Summary
ar: الملخص التنفيذي

source: Detailed Analysis
ar: تحليل مفصل

source: Personality Profile
ar: ملف الشخصية

source: Learning Style Analysis
ar: تحليل أسلوب التعلم

source: Visual
ar: بصري

source: Verbal
ar: لفظي

source: Kinesthetic
ar: حسي حركي

source: Goals & Aspirations
ar: الأهداف والطموحات

# noSpecificGoals
source: No specific goals were detailed.
ar: لم يتم توضيح أهداف محددة.

source: Key Strengths
ar: نقاط القوة

# noSpecificStrengths
source: No specific strengths were detailed.
ar: لم يتم توضيح نقاط قوة محددة.

source: Development Areas
ar: مجالات التطوير

# noSpecificDevelopmentAreas
source: No specific development areas were identified.
ar: لم يتم تحديد مجالات تطوير محددة.

source: Recommendations
ar: التوصيات

source: Career Pathways
ar: مسارات مهنية

# noSpecificCareerSuggestions
source: No specific career suggestions were provided.
ar: لم تُقدّم اقتراحات مهنية محددة.

source: Skills Development
ar: تطوير المهارات

# noSpecificSkillsSuggested
source: No specific skills were suggested.
ar: لم تُقترح مهارات محددة.

source: Freelance Opportunities
ar: فرص العمل الحر

# noSpecificFreelanceOpportunities
source: No specific freelance opportunities were suggested.
ar: لم تُقترح فرص عمل حر محددة.

source: Practical Next Steps
ar: الخطوات العملية التالية

# noSpecificPracticalSteps
source: No specific practical steps were provided.
ar: لم تُقدّم خطوات عملية محددة.

source: Words of Inspiration
ar: كلمات إلهامية

# assessmentReportTitle
source: Assessment Report
ar: تقرير التقييم

# detailedReportDescription
source: Detailed assessment report generated by Multiverse Mentor
ar: تقرير تقييم مفصل من Multiverse Mentor

# loading
source: Loading analysis
ar: جار التحليل
